tests/fixtures/get_subscription_response.json

{
    "id": 154349,
    "site": "weenect",
    "max_tracker_nb": 1,
    "period": 24,
    "amount": 8990,
    "amount_gbp": 6483,
    "currency": "EUR",
    "status": "active",
    "option_status": true,
    "payment_mean": "hipay",
    "next_charge_at": "2022-09-21T11:34:12.704032",
    "created_at": "2020-09-21T11:33:29.468075",
    "updated_at": "2020-09-21T11:34:12.716050",
    "canceled_at": null,
    "cancel_reason": null,
    "cancel_explanation": null,
    "offer_id": 4,
    "trackers": [
        100000
    ],
    "user_id": 100000,
    "is_under_commitment_period": false,
    "options": [
        {
            "id": 295616,
            "code": "premium_map",
            "int_1": 0,
            "sms": 0,
            "amount": 99,
            "currency": "EUR",
            "activated": false,
            "is_running": false,
            "subscription_id": 100000,
            "created_at": "2020-12-22T15:41:06.227849",
            "updated_at": null,
            "next_charge_at": "2021-03-29T13:09:19.260515",
            "activation_date": null
        },
        {
            "id": 210314,
            "code": "warranty",
            "int_1": 0,
            "sms": 0,
            "amount": 399,
            "currency": "EUR",
            "activated": false,
            "is_running": null,
            "subscription_id": 100000,
            "created_at": "2020-09-21T11:33:29.473065",
            "updated_at": "2020-09-21T11:33:29.473067",
            "next_charge_at": null,
            "activation_date": null
        },
        {
            "id": 210313,
            "code": "sms",
            "int_1": 20,
            "sms": 20,
            "amount": 199,
            "currency": "EUR",
            "activated": false,
            "is_running": null,
            "subscription_id": 100000,
            "created_at": "2020-09-21T11:33:29.471625",
            "updated_at": "2020-09-21T11:33:29.471629",
            "next_charge_at": null,
            "activation_date": null
        }
    ],
    "option_error_payment": 0,
    "is_under_notice_period": "NONE"
}